Revit 2027 API
BuiltInFailures.StairRampFailures.NoRailingsStringer Property
 Railings and Stringers will not be automatically generated due to bad Runs. This message may be incorrect if you have Edited the Sketch and modified some dimensions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRailingsStringer { get; }
Public Shared ReadOnly Property NoRailingsStringer As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRailingsStringer {
	FailureDefinitionId^ get ();
}
static member NoRailingsStringer : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace